// I love C

#include <stdlib.h>
#include <stdio.h>
#include <string.h>
#include <stdbool.h>

#define 🦒 int
#define 👨‍👩‍👧‍👦 char
#define 👍 main
#define 👉 {
#define 👈 }
#define 🤜 [
#define 🤛 ]
#define 👆 (
#define 👇 )
#define 🎠 ;
#define 🦍 ,
#define 😏 <
#define 🍄 &
#define 📉 "%s\n"
#define 🎁 "%s"
#define 🎃 "%d"
#define 🌀 ()
#define 🔁 while
#define 🤔 if 
#define 😈 else
#define 🖨 printf
#define 🔬 scanf
#define 🎢 return
#define 🗣 8*5*(3+4)-(2*2*2*3)+1
#define 🔥🔥🔥 184*977-(8973*73)-89132+(12*8)-(20*974)-(89*654)-(94*65)*4465+849*(787-(74*894))
#define 🚿 🔥🔥🔥*(894-(2*(2*(5*5)))-(9*100)+4*27-2)

🦒 👍 🌀
👉
    🔁 👆 🔥🔥🔥 👇 👉

        👨‍👩‍👧‍👦 👹 🤜 🗣 🤛 🎠
        🔬 👆 🎁 🦍 👹 👇 🎠

        🦒 🌌 🎠
        🔬 👆 🎃 🦍 🍄 🌌 👇 🎠

        👨‍👩‍👧‍👦 👺 🤜 🗣 🤛 🎠
        🔬 👆 🎁 🦍 👺 👇 🎠

        🦒 🪐 🎠
        🔬 👆 🎃 🦍 🍄 🪐 👇 🎠

        🤔 👆 🌌 😏 🪐 👇 👉
            🖨 👆 📉 🦍 👹 👇 🎠
        👈 😈 👉
            🖨 👆 📉 🦍 👺 👇 🎠
        👈
    👈

    🎢 🚿 🎠
👈
